conf/src/Documents/ЭП_АктПриемаПередачи/ЭП_АктПриемаПередачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭП_АктПриемаПередачи</name>
  <registerRecords>InformationRegister.ЭП_КачествоНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_ОстаткиПоОрганизацииРН</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_ОстаткиНаСкладе</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_ОстаткиНаСотрудниках</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ЭП_ВидыОперций</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.ЭП_Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.ЭП_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.ЭП_ВидНоменлкатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КачествоНоменклатуры</name>
      <type>
        <types>CatalogRef.ЭП_КачествоНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

conf/src/AccumulationRegisters/ЭП_ОстаткиНаСкладе/ЭП_ОстаткиНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_ОстаткиНаСкладе</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.ЭП_Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ЭП_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/AccumulationRegisters/ЭП_ОстаткиНаСотрудниках/ЭП_ОстаткиНаСотрудниках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_ОстаткиНаСотрудниках</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ЭП_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/InformationRegisters/ЭП_КачествоНоменклатуры/ЭП_КачествоНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_КачествоНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КачествоНоменклатуры</name>
    <type>
      <types>CatalogRef.ЭП_КачествоНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.ЭП_Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Enums/ЭП_ВидыОперций/ЭП_ВидыОперций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭП_ВидыОперций</name>
  <enumValues>
    <name>ПередачаНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ПриемНоменклатуры</name>
  </enumValues>
</mdclass:Enum>

conf/src/Documents/ЭП_АктПриемаПередачи/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
 
 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.ТолькоПросмотр = Истина;
	УстановитьУсловноеОформление();
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	 
КонецПроцедуры

#КонецОбласти 
 
#Область ОбработчикиСобытийТаблицыНоменклатура
  
  &НаКлиенте
Процедура НоменклатураИнвентарныйНомерАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	Если ПустаяСтрока(Текст) Тогда 
		
		ДанныеВыбора = ПолучитьДанныеВыбораПоИнвентарномуНомеру(Элемент, Элементы.Номенклатура.ТекущиеДанные.ИнвентарныйНомер,
		Элементы.Номенклатура.ТекущиеДанные.Номенклатура, 
		Объект.Склад, Элементы.Номенклатура.ТекущиеДанные.ВидНоменклатуры, 
		СтандартнаяОбработка); 
		
	Иначе
		
		ДанныеВыбора = ПолучитьДанныеВыбораПоИнвентарномуНомеру(Элемент, Текст, Элементы.Номенклатура.ТекущиеДанные.Номенклатура, 
		Объект.Склад, Элементы.Номенклатура.ТекущиеДанные.ВидНоменклатуры, СтандартнаяОбработка);	
		
	КонецЕсли;	 
																		
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураИнвентарныйНомерОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	НоменклатураИнвентарныйНомерПолучениеНоменклатуры(ВыбранноеЗначение, Элементы.Номенклатура.ТекущаяСтрока);
	
КонецПроцедуры 
																
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора) 
	
	 ОбработатьПодборНаСервере(ВыбранноеЗначение);
	 
КонецПроцедуры

#КонецОбласти
 
#Область ОбработчикиКомандФормы

&НаСервере
Процедура НоменклатураИнвентарныйНомерПолучениеНоменклатуры(Текст, ИндексСтроки)
	
	Если Объект.ВидОперации = Перечисления.ЭП_ВидыОперций.ПередачаНоменклатуры Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЭП_ОстаткиНаСкладеОстатки.Номенклатура КАК Номенклатура,
			|	ЭП_Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
			|ИЗ
			|	РегистрНакопления.ЭП_ОстаткиНаСкладе.Остатки КАК ЭП_ОстаткиНаСкладеОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Номенклатура КАК ЭП_Номенклатура
			|		ПО ЭП_ОстаткиНаСкладеОстатки.Номенклатура = ЭП_Номенклатура.Ссылка
			|ГДЕ
			|	ЭП_ОстаткиНаСкладеОстатки.Склад = &Склад
			|	И ЭП_ОстаткиНаСкладеОстатки.ИнвентарныйНомер = &ИнвентарныйНомер
			|	И ЭП_ОстаткиНаСкладеОстатки.КоличествоОстаток > 0";
		
		Запрос.УстановитьПараметр("ИнвентарныйНомер", Текст);
		Запрос.УстановитьПараметр("Склад", Объект.Склад);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			
			СтрокаТЧ = Объект.Номенклатура.НайтиПоИдентификатору(ИндексСтроки);
			СтрокаТЧ.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			СтрокаТЧ.ВидНоменклатуры = ВыборкаДетальныеЗаписи.ВидНоменклатуры;
			
		КонецЦикла; 
		
	Иначе 
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЭП_ОстаткиНаСотрудниках.Номенклатура КАК Номенклатура,
			|	ЭП_Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
			|ИЗ
			|	РегистрНакопления.ЭП_ОстаткиНаСотрудниках КАК ЭП_ОстаткиНаСотрудниках
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭП_Номенклатура КАК ЭП_Номенклатура
			|		ПО ЭП_ОстаткиНаСотрудниках.Номенклатура = ЭП_Номенклатура.Ссылка
			|ГДЕ
			|	ЭП_ОстаткиНаСотрудниках.Сотрудник = &Сотрудник
			|	И ЭП_ОстаткиНаСотрудниках.ИнвентарныйНомер = &ИнвентарныйНомер
			|	И ЭП_ОстаткиНаСотрудниках.Количество > 0";
		
		Запрос.УстановитьПараметр("ИнвентарныйНомер", Текст);
		Запрос.УстановитьПараметр("Сотрудник", Объект.Сотрудник);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			
			СтрокаТЧ = Объект.Номенклатура.НайтиПоИдентификатору(ИндексСтроки);
			СтрокаТЧ.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура; 
			СтрокаТЧ.ВидНоменклатуры = ВыборкаДетальныеЗаписи.ВидНоменклатуры;

		КонецЦикла; 
		
	КонецЕсли;
КонецПроцедуры

 &НаКлиенте
Функция ПолучитьДанныеВыбораПоИнвентарномуНомеру(Элемент, Склад, Номенклатура, ИнвентарныйНомер, ВидНоменклатуры, СтандартнаяОбработка)
	
	РежимРаботы = ПолучениеДанныхРежимаРаботы(Объект.ВидОперации);
	
	Если РежимРаботы Тогда
		
	    СтандартнаяОбработка = Ложь;
	                                                             
	    ПараметрыПодбора = Новый Структура("Отбор,СтрокаПоиска,ВыборГруппИЭлементов",
	                                Новый Структура(),                                 "",                                               
									ПредопределенноеЗначение("ИспользованиеГруппИЭлементов.Элементы"));
	                                
	    ПараметрыПодбора.Вставить("ДополнительныеПараметры", Новый Структура("Склад, Номенклатура, ИнвентарныйНомер, РежимРаботы, Сотрудник, ВидНоменклатуры",
	                                                                           	Склад, 
	                                                                            Номенклатура,
																				ИнвентарныйНомер, РежимРаботы, Ложь, ВидНоменклатуры));
	    
	    Возврат	ПолучитьДанныеВыбора(Тип("СправочникСсылка.ЭП_Номенклатура"), ПараметрыПодбора);  
		
	Иначе 
				
		СтандартнаяОбработка = Ложь;
	                                                             
	    ПараметрыПодбора = Новый Структура("Отбор,СтрокаПоиска,ВыборГруппИЭлементов",
	                                Новый Структура(),                                 "",                                               
									ПредопределенноеЗначение("ИспользованиеГруппИЭлементов.Элементы"));
	                                
	    ПараметрыПодбора.Вставить("ДополнительныеПараметры", Новый Структура("Склад, Номенклатура, ИнвентарныйНомер, РежимРаботы, Сотрудник, ВидНоменклатуры",
	                                                                           	Склад, 
	                                                                            Номенклатура,
																				ИнвентарныйНомер, РежимРаботы, Объект.Сотрудник, ВидНоменклатуры));
	    
	    Возврат	ПолучитьДанныеВыбора(Тип("СправочникСсылка.ЭП_Номенклатура"), ПараметрыПодбора); 
		
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ОткрытьФормуПодбора(Команда)
	
	Если ЗначениеЗаполнено(Объект.ВидОперации) Тогда	
		
		ПарметрыПодбора = Новый Структура;
		ПарметрыПодбора.Вставить("ВидОперации", Объект.ВидОперации);
		ПарметрыПодбора.Вставить("НоменклатураВыбор", Объект.Номенклатура);
		ПарметрыПодбора.Вставить("Сотрудник", Объект.Сотрудник);
		ПарметрыПодбора.Вставить("Склад", Объект.Склад);
		ПарметрыПодбора.Вставить("Организация", Объект.Организация);

		ОткрытьФорму("Документ.ЭП_АктПриемаПередачи.Форма.ФормаПодбора", ПарметрыПодбора, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		
		ПоказатьПредупреждение(,"Необходимо выбрать вид операции документа для открытия формы подбора",,"Внимание!"); 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

 &НаСервереБезКонтекста
Функция ПроверкаРоли() 
	
	Возврат Пользователи.РолиДоступны("ЭП_СогласованиеДокументовСклада",,);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучениеДанныхРежимаРаботы(РежимРаботы)
	Если РежимРаботы = Перечисления.ЭП_ВидыОперций.ПередачаНоменклатуры Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;	

КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	Элементы.СтатусДокумента.Доступность = ПроверкаРоли();
	Элементы.Ответсвенный.Доступность = ПроверкаРоли();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидНоменклатурыАвтоПодборНаСервере(СтрокаПоиска) 
	
	Возврат Справочники.ЭП_ВидНоменлкатуры.ПолучитьДанныеВыбора(Новый Структура("СтрокаПоиска, ВводПоСтрокеРасширенный", СтрокаПоиска, Истина));

КонецФункции

&НаКлиенте
Процедура ВидНоменклатурыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ВидНоменклатурыАвтоПодборНаСервере(Текст);

КонецПроцедуры

&НаСервере
Процедура ОбработатьПодборНаСервере(АдресВременногоХранилища)
																
	Объект.Номенклатура.Загрузить(ПолучитьИзВременногоХранилища(АдресВременногоХранилища)); 
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНоменкатураНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыПередачи = Элементы.Номенклатура.ТекущиеДанные.ВидНоменклатуры;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборПоВиду", ПараметрыПередачи);
	ОткрытьФорму("Справочник.ЭП_Номенклатура.ФормаВыбора",ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыПередачи = Элементы.Номенклатура.ТекущиеДанные.Номенклатура;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборПоВиду", ПараметрыПередачи);
	ОткрытьФорму("Справочник.ЭП_ВидНоменлкатуры.ФормаВыбора",ПараметрыФормы, Элемент); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	//ВидОперации = ПолучениеДанныхРежимаРаботы(Объект.ВидОперации);
	////Если ВидОперации Тогда	
	////	ЭтотОбъект.Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаДокументЭП_АктПриемаПередачиПечатьактВозврата.Видимость = Ложь;
	////	ЭтотОбъект.Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаДокументЭП_АктПриемаПередачиПечатьАктВыдачи.Видимость = Истина;
	////Иначе
	////	ЭтотОбъект.Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаДокументЭП_АктПриемаПередачиПечатьактВозврата.Видимость = Истина;
	////	ЭтотОбъект.Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаДокументЭП_АктПриемаПередачиПечатьАктВыдачи.Видимость = Ложь;
	////КонецЕсли;
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти 


#Область АвтоматическоеЗаполнениеПоляКачествоНоменклатуры
 
 &НаСервере
Функция ПолучитьКачествоНоменклатуры(Номенклатура, ИнвентарныйНомер)   
	 Отбор = Новый Структура("Номенклатура, ИнвентарныйНомер", Номенклатура, ИнвентарныйНомер);
	 Возврат РегистрыСведений.ЭП_КачествоНоменклатуры.ПолучитьПоследнее(ТекущаяДатаСеанса(), Отбор).КачествоНоменклатуры;
КонецФункции

&НаКлиенте
Процедура УстановитьКачествоНоменклатуры()
	СтрокаНоменклатуры = Элементы.Номенклатура.ТекущиеДанные; 
	Если ЗначениеЗаполнено(СтрокаНоменклатуры.Номенклатура) И ЗначениеЗаполнено(СтрокаНоменклатуры.ИнвентарныйНомер) Тогда
		КачествоНоменклатуры = ПолучитьКачествоНоменклатуры(СтрокаНоменклатуры.Номенклатура, СтрокаНоменклатуры.ИнвентарныйНомер);
		Если КачествоНоменклатуры.Пустая() Тогда
			СтрокаНоменклатуры.КачествоНоменклатуры = ПредопределенноеЗначение("Справочник.ЭП_КачествоНоменклатуры.Новый");
		Иначе
			СтрокаНоменклатуры.КачествоНоменклатуры = КачествоНоменклатуры; 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураИнвентарныйНомерПриИзменении(Элемент)
	УстановитьКачествоНоменклатуры();	
КонецПроцедуры 

&НаКлиенте
Процедура НоменклатураНоменкатураПриИзменении(Элемент)
	УстановитьКачествоНоменклатуры();	
КонецПроцедуры

#КонецОбласти
